cats/ninety_nine_cats/app/controllers/cats_controller.rb

    def update
        @cat = Cat.find_by(id: params[:id])

        if @cat.update(cat_params)
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["color", "tabby"], ["updated_at", "2023-03-12 12:55:58.032851"], ["id", 4]]